InformationRegisters/НастройкиСтатейДоходовРасходовПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСтатейДоходовРасходовПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДоходовРасходовПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаБанковскойКартой</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтатьи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтатейДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСтатейДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСтатейДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиСтатейДоходовРасходовПоУмолчанию/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	// процедура запрета убрана в список, иначе срабатывает при программном перезаполнении регистра
	//Если ЭтотОбъект.Количество() = 0 Тогда 
	//	// запрет удаления
	//	Отказ = Истина; 
	//КонецЕсли;
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(ТекЗапись.СтатьяДоходовРасходов) И НЕ ЗначениеЗаполнено(ТекЗапись.ТипСтатьи) Тогда
			ТекЗапись.ТипСтатьи = ?(ТекЗапись.СтатьяДоходовРасходов.ИспользуетсяВУчетеДоходов, Перечисления.ТипыСтатейДоходовРасходов.Доход, Перечисления.ТипыСтатейДоходовРасходов.Расход);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Для каждого Запись из ЭтотОбъект Цикл
			ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаполнения);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
